wedding_planner/app/controllers/users_controller.rb

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "name" = ?, "last_name" = ?, "partner" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Noah"], ["last_name", "Hoepfinger"], ["partner", "Izzy"], ["updated_at", "2024-11-21 20:49:47.683152"], ["id", 3]]